---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DimStyleSuppressSpaces
source: html/cc90c92b-1ff2-0ee5-cfcd-fca90d14179e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DimStyleSuppressSpaces Property

"Suppress Spaces"

## Syntax (C#)
```csharp
public static ForgeTypeId DimStyleSuppressSpaces { get; }
```